# Sobre
- Autores: Enzo Rigon e Gabriel Musskopf
- Dataset: https://www.kaggle.com/datasets/parisrohan/credit-score-classification/data
- Slides: https://asavbrm-my.sharepoint.com/:b:/g/personal/gmusskopf_edu_unisinos_br/IQBeuL8vealjTrRBUkBNF24VAR8QZnUWI-2lid9BGIx7Nho?e=n0vb2H
- Apresentação: https://asavbrm-my.sharepoint.com/:v:/g/personal/gmusskopf_edu_unisinos_br/IQCLYeWgMJ6eTID_lfQLeru6AaA21avPKeNbKhBpV0QFvK0?e=SwOo6B&nav=eyJyZWZlcnJhbEluZm8iOnsicmVmZXJyYWxBcHAiOiJTdHJlYW1XZWJBcHAiLCJyZWZlcnJhbFZpZXciOiJTaGFyZURpYWxvZy1MaW5rIiwicmVmZXJyYWxBcHBQbGF0Zm9ybSI6IldlYiIsInJlZmVycmFsTW9kZSI6InZpZXcifX0%3D

## Estrutura
Para facilitar o desenvolvimento e tempo de execução, separamos em três notebooks distintos. Mais informações sobre no README.md.

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

# Como preparar o ambiente para rodar o projeto
Para começar, é necessário descompactar o arquivo `data.csv.zip` para obter o arquivo `data.csv` utilizado na análise.
No projeto original, existiam dois datasets separados: um para treino e outro para teste. Neste repositório, ambos já estão mesclados em um único arquivo (`data.csv`), facilitando o processamento e a limpeza dos dados.
Certifique-se de que o arquivo `data.csv` está presente na mesma pasta do notebook antes de iniciar a execução das células.

# Passo 1: Análise Inicial do Dataset
No início do notebook, realizamos uma análise exploratória básica para verificar a integridade do dataset e identificar suas principais características e possíveis problemas.
Essas funções ajudam a entender a estrutura dos dados, tipos de variáveis, valores ausentes, duplicados e outras peculiaridades que podem impactar o processo de limpeza e modelagem.

In [1]:
df = pd.read_csv('data.csv', sep=',')
df.head()

NameError: name 'pd' is not defined

In [ ]:
df.shape

(150000, 28)

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150000 entries, 0 to 149999
Data columns (total 28 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   ID                        150000 non-null  object
 1   Customer_ID               150000 non-null  object
 2   Month                     150000 non-null  object
 3   Name                      135000 non-null  object
 4   Age                       150000 non-null  object
 5   SSN                       150000 non-null  object
 6   Occupation                150000 non-null  object
 7   Annual_Income             150000 non-null  object
 8   Monthly_Inhand_Salary     127500 non-null  float64
 9   Num_Bank_Accounts         150000 non-null  int64
 10  Num_Credit_Card           150000 non-null  int64
 11  Interest_Rate             150000 non-null  int64
 12  Num_of_Loan               150000 non-null  object
 13  Type_of_Loan              132888 non-null  object
 14  Delay_from_due_date       150000 non-null  int64
 15  Num_of_Delayed_Payment    139500 non-null  object
 16  Changed_Credit_Limit      150000 non-null  object
 17  Num_Credit_Inquiries      147000 non-null  float64
 18  Credit_Mix                150000 non-null  object
 19  Outstanding_Debt          150000 non-null  object
 20  Credit_Utilization_Ratio  150000 non-null  float64
 21  Credit_History_Age        136500 non-null  object
 22  Payment_of_Min_Amount     150000 non-null  object
 23  Total_EMI_per_month       150000 non-null  float64
 24  Amount_invested_monthly   143250 non-null  object
 25  Payment_Behaviour         150000 non-null  object
 26  Monthly_Balance           148238 non-null  object
 27  Credit_Score              100000 non-null  object
dtypes: float64(4), int64(4), object(20)
memory usage: 32.0+ MB

In [ ]:
df.columns

Index(['ID', 'Customer_ID', 'Month', 'Name', 'Age', 'SSN', 'Occupation',
       'Annual_Income', 'Monthly_Inhand_Salary', 'Num_Bank_Accounts',
       'Num_Credit_Card', 'Interest_Rate', 'Num_of_Loan', 'Type_of_Loan',
       'Delay_from_due_date', 'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_Utilization_Ratio', 'Credit_History_Age',
       'Payment_of_Min_Amount', 'Total_EMI_per_month',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')

In [ ]:
df.describe()

,Monthly_Inhand_Salary,Num_Bank_Accounts,Num_Credit_Card,Interest_Rate,Delay_from_due_date,Num_Credit_Inquiries,Credit_Utilization_Ratio,Total_EMI_per_month
count,127500.000000,150000.000000,150000.000000,150000.000000,150000.000000,147000.000000,150000.000000,150000.000000
mean,4190.115139,17.006940,22.623447,71.234907,21.063400,28.529014,32.283309,1432.513579
std,3180.489657,117.069476,129.143006,461.537193,14.860154,194.456058,5.113315,8403.759977
min,303.645417,-1.000000,0.000000,1.000000,-5.000000,0.000000,20.000000,0.000000
25%,1625.265833,3.000000,4.000000,8.000000,10.000000,3.000000,28.054731,30.947775
50%,3091.000000,6.000000,5.000000,13.000000,18.000000,6.000000,32.297058,71.280006
75%,5948.454596,7.000000,7.000000,20.000000,28.000000,9.000000,36.487954,166.279555
max,15204.633333,1798.000000,1499.000000,5799.000000,67.000000,2597.000000,50.000000,82398.000000

In [ ]:
df.isna().sum()

ID                              0
Customer_ID                     0
Month                           0
Name                        15000
Age                             0
SSN                             0
Occupation                      0
Annual_Income                   0
Monthly_Inhand_Salary       22500
Num_Bank_Accounts               0
Num_Credit_Card                 0
Interest_Rate                   0
Num_of_Loan                     0
Type_of_Loan                17112
Delay_from_due_date             0
Num_of_Delayed_Payment      10500
Changed_Credit_Limit            0
Num_Credit_Inquiries         3000
Credit_Mix                      0
Outstanding_Debt                0
Credit_Utilization_Ratio        0
Credit_History_Age          13500
Payment_of_Min_Amount           0
Total_EMI_per_month             0
Amount_invested_monthly      6750
Payment_Behaviour               0
Monthly_Balance              1762
Credit_Score                50000
dtype: int64

In [ ]:
df.duplicated().sum()

np.int64(0)

In [ ]:
na_counts = df.isna().sum()
cols_with_na = na_counts[na_counts > 0]
print(cols_with_na)
print(list(cols_with_na.index))

Name                       15000
Monthly_Inhand_Salary      22500
Type_of_Loan               17112
Num_of_Delayed_Payment     10500
Num_Credit_Inquiries        3000
Credit_History_Age         13500
Amount_invested_monthly     6750
Monthly_Balance             1762
Credit_Score               50000
dtype: int64
['Name', 'Monthly_Inhand_Salary', 'Type_of_Loan', 'Num_of_Delayed_Payment', 'Num_Credit_Inquiries', 'Credit_History_Age', 'Amount_invested_monthly', 'Monthly_Balance', 'Credit_Score']

# Passo 2: Remoção de colunas irrelevantes ou sensíveis

Neste passo, removemos as colunas que já sabemos que não serão utilizadas na análise, como 'Name' e 'SSN', por conterem informações pessoais ou redundantes. Essa limpeza inicial é fundamental para simplificar o dataset, evitar riscos de privacidade e garantir que o foco permaneça apenas nas variáveis relevantes para o problema de crédito.

In [4]:
columns_to_drop = ['Name', 'SSN']
df = df.drop(columns=columns_to_drop)

NameError: name 'df' is not defined

# Passo 3: Verificação e tratamento dos tipos de colunas

Nesta etapa, analisamos os tipos de dados de cada coluna para identificar inconsistências, como colunas que deveriam ser numéricas mas estão como texto. Esse processo é essencial para garantir que cada variável esteja corretamente formatada, facilitando a limpeza, análise e modelagem dos dados.

In [ ]:
obj_cols = df.select_dtypes(include=['object']).columns
print(obj_cols)
print(len(obj_cols))

Index(['ID', 'Customer_ID', 'Month', 'Age', 'Occupation', 'Annual_Income',
       'Num_of_Loan', 'Type_of_Loan', 'Num_of_Delayed_Payment',
       'Changed_Credit_Limit', 'Credit_Mix', 'Outstanding_Debt',
       'Credit_History_Age', 'Payment_of_Min_Amount',
       'Amount_invested_monthly', 'Payment_Behaviour', 'Monthly_Balance',
       'Credit_Score'],
      dtype='object')
18

In [ ]:
cols_should_be_num = [
    'Age', 'Annual_Income', 'Num_of_Loan', 'Num_of_Delayed_Payment',
    'Changed_Credit_Limit', 'Outstanding_Debt',
    'Amount_invested_monthly', 'Monthly_Balance'
]
numerical_cols = df.select_dtypes(include=['number']).columns.tolist()
cols_should_be_num = list(set(cols_should_be_num + numerical_cols))

# Passo 4: Análise detalhada das colunas numéricas

Utilizamos uma função específica para examinar as colunas numéricas do dataset, avaliando a presença de valores ausentes (NaN), zeros, negativos, outliers e valores inconsistentes. Essa etapa é fundamental para identificar problemas de qualidade dos dados e orientar os próximos passos de limpeza e tratamento.

In [ ]:
def analyze_numerical_column(cols, print_zeros=True):
    total = len(df)
    for col in cols:
        s = df[col]
        s_str = s.astype(str).str.strip().replace(',', '')
        converted = pd.to_numeric(s_str, errors='coerce')

        # pular coluna se não houver nada numérico e nem valores originais
        if converted.dropna().empty and not s.notna().any():
            continue

        print('---', col, '---')

        # Contar valores ausentes (None/NaN)
        na_mask = converted.isna()
        na_count = int(na_mask.sum())
        if na_count and na_count > 0:
            print(f'NaN/None: {na_count} ({100*na_count/total:0.2f}%)')
            display(df.loc[na_mask, ['ID', col]].head(10))

        # 1) valores não conversíveis (origem não nula mas converte para NaN)
        bad_mask = s.notna() & converted.isna()
        bad_count = int(bad_mask.sum())
        if bad_count and bad_count > 0:
            print(f'non-convertible: {bad_count} ({100*bad_count/total:0.2f}%)')
            print('examples non-convertible values:', pd.Series(s[bad_mask].unique()).head(20).tolist())
            display(df.loc[bad_mask, ['ID', col]].head(10))

        # 2) zeros e negativos (caso sejam inválidos no seu contexto)
        zeros = (converted == 0)
        zcount = int(zeros.sum())
        if print_zeros and zcount and zcount > 0:
            print(f'zeros: {zcount} ({100*zcount/total:0.2f}%)')
            display(df.loc[zeros, ['ID', col]].head(5))

        negs = (converted < 0)
        ncount = int(negs.sum())
        if ncount and ncount > 0:
            print(f'negatives: {ncount} ({100*ncount/total:0.2f}%)')
            display(df.loc[negs, ['ID', col]].head(5))

        # 3) outliers via IQR
        vals = converted.dropna()
        if len(vals) >= 5:
            q1 = vals.quantile(0.25)
            q3 = vals.quantile(0.75)
            iqr = q3 - q1
            lo = q1 - 1.5 * iqr
            hi = q3 + 1.5 * iqr
            out_mask = (converted < lo) | (converted > hi)
            ocnt = int(out_mask.sum())
            if ocnt and ocnt > 0:
                print(f'outliers (IQR): {ocnt} ({100*ocnt/total:0.2f}%)')
                print(f'Media: {vals.mean():.2f}, Desvio Padrao: {vals.std():.2f}')
                display(df.loc[out_mask, ['ID', col]].assign(_converted=converted[out_mask]).head(10))
        else:
            print('not enough numeric values for outlier detection')

        print()

In [ ]:
analyze_numerical_column(cols_should_be_num)

--- Amount_invested_monthly ---
NaN/None: 13230 (8.82%)

         ID Amount_invested_monthly
18   0x161c               __10000__
23   0x1621               __10000__
28   0x162a               __10000__
60   0x165a                     NaN
61   0x165b                     NaN
91   0x1689                     NaN
111  0x16a5                     NaN
121  0x16b7               __10000__
142  0x16d4               __10000__
161  0x16f3               __10000__

non-convertible: 6480 (4.32%)
examples non-convertible values: ['__10000__']

         ID Amount_invested_monthly
18   0x161c               __10000__
23   0x1621               __10000__
28   0x162a               __10000__
121  0x16b7               __10000__
142  0x16d4               __10000__
161  0x16f3               __10000__
200  0x172e               __10000__
209  0x173b               __10000__
284  0x17aa               __10000__
346  0x1808               __10000__

zeros: 275 (0.18%)

          ID Amount_invested_monthly
184   0x1716                     0.0
1004  0x1be2                     0.0
1698  0x1ff4                     0.0
1719  0x2011                     0.0
2766  0x2634                     0.0

outliers (IQR): 11355 (7.57%)
Media: 195.31, Desvio Padrao: 198.60

         ID Amount_invested_monthly  _converted
19   0x161d       825.2162699393922  825.216270
43   0x1641       618.2023912505837  618.202391
49   0x164b       698.8732707169384  698.873271
54   0x1650       930.3918977796665  930.391898
55   0x1651         870.52238171816  870.522382
68   0x1666       649.8093641841638  649.809364
69   0x1667       546.3805705230692  546.380571
93   0x168b       686.1262165951837  686.126217
99   0x1695       494.8422277056662  494.842228
101  0x1697       635.1465605054178  635.146561

--- Annual_Income ---
NaN/None: 10500 (7.00%)

         ID Annual_Income
10   0x1610     34847.84_
27   0x1629     30689.89_
32   0x1632     35547.71_
56   0x1656     34081.38_
66   0x1664    114838.41_
94   0x168c     88640.24_
98   0x1694     54392.16_
106  0x16a0     8701.545_
111  0x16a5     8701.545_
115  0x16ad     25546.26_

non-convertible: 10500 (7.00%)
examples non-convertible values: ['34847.84_', '30689.89_', '35547.71_', '34081.38_', '114838.41_', '88640.24_', '54392.16_', '8701.545_', '25546.26_', '92047.08_', '97791.42_', '10183.015_', '106733.13_', '12600.445_', '57983.12_', '34290.12_', '43070.24_', '6515990.0_', '39641.54_', '29469.98_']

         ID Annual_Income
10   0x1610     34847.84_
27   0x1629     30689.89_
32   0x1632     35547.71_
56   0x1656     34081.38_
66   0x1664    114838.41_
94   0x168c     88640.24_
98   0x1694     54392.16_
106  0x16a0     8701.545_
111  0x16a5     8701.545_
115  0x16ad     25546.26_

outliers (IQR): 3884 (2.59%)
Media: 174093.55, Desvio Padrao: 1410067.59

         ID Annual_Income  _converted
54   0x1650    10909427.0  10909427.0
245  0x176f      586359.0    586359.0
361  0x181f    18334118.0  18334118.0
368  0x182a    19717385.0  19717385.0
379  0x1839     2709655.0   2709655.0
420  0x1876     2592822.0   2592822.0
564  0x194e    19257912.0  19257912.0
602  0x1988    22335783.0  22335783.0
617  0x199f    16367214.0  16367214.0
895  0x1b3d     9351702.0   9351702.0

--- Num_of_Loan ---
NaN/None: 7221 (4.81%)

         ID Num_of_Loan
37   0x1637          0_
80   0x167a          3_
84   0x167e          3_
94   0x168c          2_
119  0x16b1          5_
125  0x16bb          2_
131  0x16c5          0_
144  0x16da          0_
158  0x16ec          5_
256  0x1782          2_

non-convertible: 7221 (4.81%)
examples non-convertible values: ['0_', '3_', '2_', '5_', '8_', '9_', '4_', '7_', '1_', '6_', '597_', '92_', '1347_', '1185_', '235_', '1459_', '1320_', '630_', '359_', '1225_']

         ID Num_of_Loan
37   0x1637          0_
80   0x167a          3_
84   0x167e          3_
94   0x168c          2_
119  0x16b1          5_
125  0x16bb          2_
131  0x16c5          0_
144  0x16da          0_
158  0x16ec          5_
256  0x1782          2_

zeros: 15543 (10.36%)

        ID Num_of_Loan
32  0x1632           0
33  0x1633           0
35  0x1635           0
36  0x1636           0
38  0x1638           0

negatives: 5850 (3.90%)

        ID Num_of_Loan
31  0x162d        -100
34  0x1634        -100
39  0x1639        -100
53  0x164f        -100
61  0x165b        -100

outliers (IQR): 6547 (4.36%)
Media: 2.94, Desvio Padrao: 64.08

         ID Num_of_Loan  _converted
21   0x161f         967       967.0
31   0x162d        -100      -100.0
34   0x1634        -100      -100.0
39   0x1639        -100      -100.0
53   0x164f        -100      -100.0
61   0x165b        -100      -100.0
64   0x1662        -100      -100.0
78   0x1674        -100      -100.0
126  0x16bc        -100      -100.0
180  0x170e        -100      -100.0

--- Age ---
NaN/None: 7416 (4.94%)

         ID  Age
8    0x160e  28_
54   0x1650  34_
58   0x1658  30_
71   0x1669  24_
89   0x1687  33_
97   0x1693  35_
123  0x16b9  30_
184  0x1716  31_
227  0x1755  40_
236  0x1762  37_

non-convertible: 7416 (4.94%)
examples non-convertible values: ['28_', '34_', '30_', '24_', '33_', '35_', '31_', '40_', '37_', '54_', '21_', '20_', '43_', '38_', '18_', '2111_', '46_', '16_', '19_', '47_']

         ID  Age
8    0x160e  28_
54   0x1650  34_
58   0x1658  30_
71   0x1669  24_
89   0x1687  33_
97   0x1693  35_
123  0x16b9  30_
184  0x1716  31_
227  0x1755  40_
236  0x1762  37_

negatives: 1350 (0.90%)

         ID   Age
2    0x1604  -500
113  0x16ab  -500
289  0x17b3  -500
340  0x17fe  -500
560  0x194a  -500

outliers (IQR): 4057 (2.70%)
Media: 110.66, Desvio Padrao: 687.04

         ID   Age  _converted
2    0x1604  -500      -500.0
56   0x1656  7580      7580.0
113  0x16ab  -500      -500.0
122  0x16b8   181       181.0
219  0x1749   995       995.0
243  0x176d  5079      5079.0
288  0x17b2  6409      6409.0
289  0x17b3  -500      -500.0
301  0x17c3  7080      7080.0
328  0x17ee   849       849.0

--- Num_Bank_Accounts ---
zeros: 6494 (4.33%)

        ID  Num_Bank_Accounts
48  0x164a                  0
49  0x164b                  0
50  0x164c                  0
51  0x164d                  0
52  0x164e                  0

negatives: 37 (0.02%)

           ID  Num_Bank_Accounts
30330  0xc7b8                 -1
30331  0xc7b9                 -1
30332  0xc7ba                 -1
30333  0xc7bb                 -1
30334  0xc7bc                 -1

outliers (IQR): 1950 (1.30%)
Media: 17.01, Desvio Padrao: 117.07

          ID  Num_Bank_Accounts  _converted
267   0x1791               1414        1414
288   0x17b2               1231        1231
310   0x17d0                 67          67
339   0x17fd                572         572
356   0x1816               1488        1488
756   0x1a6e                 91          91
807   0x1ab9                528         528
1057  0x1c33               1647        1647
1122  0x1c94               1696        1696
1238  0x1d40               1338        1338

--- Delay_from_due_date ---
zeros: 1821 (1.21%)

        ID  Delay_from_due_date
24  0x1626                    0
48  0x164a                    0
50  0x164c                    0
51  0x164d                    0
52  0x164e                    0

negatives: 889 (0.59%)

        ID  Delay_from_due_date
1   0x1603                   -1
49  0x164b                   -1
74  0x1670                   -2
78  0x1674                   -1
79  0x1675                   -2

outliers (IQR): 5998 (4.00%)
Media: 21.06, Desvio Padrao: 14.86

         ID  Delay_from_due_date  _converted
232  0x175e                   61          61
233  0x175f                   61          61
234  0x1760                   61          61
235  0x1761                   61          61
236  0x1762                   61          61
237  0x1763                   61          61
238  0x1764                   61          61
239  0x1765                   61          61
294  0x17b8                   58          58
368  0x182a                   59          59

--- Total_EMI_per_month ---
zeros: 15615 (10.41%)

        ID  Total_EMI_per_month
32  0x1632                  0.0
33  0x1633                  0.0
34  0x1634                  0.0
35  0x1635                  0.0
36  0x1636                  0.0

outliers (IQR): 10696 (7.13%)
Media: 1432.51, Desvio Padrao: 8403.76

        ID  Total_EMI_per_month    _converted
40  0x163e         15015.000000  15015.000000
45  0x1643         15515.000000  15515.000000
50  0x164c           911.220179    911.220179
51  0x164d         23834.000000  23834.000000
52  0x164e         32662.000000  32662.000000
53  0x164f           911.220179    911.220179
54  0x1650           911.220179    911.220179
55  0x1651           911.220179    911.220179
76  0x1672         16415.000000  16415.000000
94  0x168c         80357.000000  80357.000000

--- Monthly_Balance ---
NaN/None: 1777 (1.18%)

         ID Monthly_Balance
197  0x1727             NaN
314  0x17d8             NaN
388  0x1846             NaN
456  0x18ae             NaN
457  0x18af             NaN
462  0x18b4             NaN
463  0x18b5             NaN
638  0x19bc             NaN
692  0x1a0e             NaN
763  0x1a79             NaN

non-convertible: 15 (0.01%)
examples non-convertible values: ['__-333333333333333333333333333__']

             ID                   Monthly_Balance
5545     0x367f  __-333333333333333333333333333__
26177    0xaf63  __-333333333333333333333333333__
29158    0xc0d8  __-333333333333333333333333333__
35570    0xe66c  __-333333333333333333333333333__
38622    0xf84c  __-333333333333333333333333333__
60009   0x1759f  __-333333333333333333333333333__
75251   0x1ceed  __-333333333333333333333333333__
82918   0x1fbd8  __-333333333333333333333333333__
83255   0x1fdd1  __-333333333333333333333333333__
111363   0x9b2d  __-333333333333333333333333333__

outliers (IQR): 11460 (7.64%)
Media: 402.72, Desvio Padrao: 213.84

        ID     Monthly_Balance   _converted
16  0x161a  1043.3159778669492  1043.315978
17  0x161b   998.8692967863226   998.869297
20  0x161e   810.7821526659284   810.782153
21  0x161f   963.9215811205684   963.921581
22  0x1620   968.5555173846187   968.555517
23  0x1621    895.494583180492   895.494583
47  0x1645   796.2349097481042   796.234910
48  0x164a    858.462474411158   858.462474
50  0x164c  1038.5694068321734  1038.569407
51  0x164d   899.1987716145285   899.198772

--- Num_of_Delayed_Payment ---
NaN/None: 14671 (9.78%)

        ID Num_of_Delayed_Payment
1   0x1603                    NaN
4   0x1606                    NaN
6   0x1608                     8_
11  0x1611                     3_
30  0x162c                    NaN
32  0x1632                    NaN
33  0x1633                    NaN
53  0x164f                     3_
54  0x1650                     2_
70  0x1668                    NaN

non-convertible: 4171 (2.78%)
examples non-convertible values: ['8_', '3_', '2_', '13_', '14_', '12_', '22_', '4_', '11_', '21_', '10_', '183_', '9_', '19_', '24_', '17_', '23_', '20_', '6_', '1_']

         ID Num_of_Delayed_Payment
6    0x1608                     8_
11   0x1611                     3_
53   0x164f                     3_
54   0x1650                     2_
119  0x16b1                    13_
124  0x16ba                    14_
141  0x16d3                    12_
176  0x170a                     8_
298  0x17c0                    22_
324  0x17e6                    14_

zeros: 2352 (1.57%)

        ID Num_of_Delayed_Payment
13  0x1613                      0
72  0x166e                      0
73  0x166f                      0
74  0x1670                      0
75  0x1671                      0

negatives: 897 (0.60%)

          ID Num_of_Delayed_Payment
10    0x1610                     -1
698   0x1a18                     -1
1253  0x1d57                     -3
1561  0x1f27                     -2
2167  0x22b1                     -1

outliers (IQR): 1098 (0.73%)
Media: 30.94, Desvio Padrao: 224.72

          ID Num_of_Delayed_Payment  _converted
252   0x177a                   3318      3318.0
284   0x17aa                   3083      3083.0
304   0x17ca                   1338      1338.0
409   0x1867                   3104      3104.0
706   0x1a24                   1106      1106.0
807   0x1ab9                    834       834.0
1032  0x1c0e                   2672      2672.0
1212  0x1d1a                   2008      2008.0
1303  0x1da1                    538       538.0
1611  0x1f71                   3478      3478.0

--- Monthly_Inhand_Salary ---
NaN/None: 22500 (15.00%)

        ID  Monthly_Inhand_Salary
1   0x1603                    NaN
2   0x1604                    NaN
3   0x1605                    NaN
5   0x1607                    NaN
11  0x1611                    NaN
14  0x1614                    NaN
18  0x161c                    NaN
33  0x1633                    NaN
37  0x1637                    NaN
40  0x163e                    NaN

outliers (IQR): 2566 (1.71%)
Media: 4190.12, Desvio Padrao: 3180.49

          ID  Monthly_Inhand_Salary    _converted
1728  0x2022           14258.026667  14258.026667
1729  0x2023           14258.026667  14258.026667
1730  0x2024           14258.026667  14258.026667
1731  0x2025           14258.026667  14258.026667
1732  0x2026           14258.026667  14258.026667
1733  0x2027           14258.026667  14258.026667
1734  0x2028           14258.026667  14258.026667
1735  0x2029           14258.026667  14258.026667
2352  0x23ca           14710.533333  14710.533333
2353  0x23cb           14710.533333  14710.533333

--- Num_Credit_Card ---
zeros: 29 (0.02%)

          ID  Num_Credit_Card
4716  0x31a2                0
4717  0x31a3                0
4718  0x31a4                0
4719  0x31a5                0
9278  0x4c5c                0

outliers (IQR): 3450 (2.30%)
Media: 22.62, Desvio Padrao: 129.14

         ID  Num_Credit_Card  _converted
10   0x1610             1385        1385
40   0x163e             1288        1288
157  0x16eb             1029        1029
163  0x16f5              488         488
207  0x1735             1381        1381
215  0x1741              898         898
280  0x17a6              518         518
324  0x17e6             1005        1005
340  0x17fe             1327        1327
343  0x1801             1189        1189

--- Num_Credit_Inquiries ---
NaN/None: 3000 (2.00%)

         ID  Num_Credit_Inquiries
18   0x161c                   NaN
47   0x1645                   NaN
113  0x16ab                   NaN
115  0x16ad                   NaN
187  0x1719                   NaN
199  0x1729                   NaN
241  0x176b                   NaN
268  0x1792                   NaN
280  0x17a6                   NaN
289  0x17b3                   NaN

zeros: 8074 (5.38%)

         ID  Num_Credit_Inquiries
120  0x16b6                   0.0
121  0x16b7                   0.0
128  0x16c2                   0.0
176  0x170a                   0.0
177  0x170b                   0.0

outliers (IQR): 2496 (1.66%)
Media: 28.53, Desvio Padrao: 194.46

          ID  Num_Credit_Inquiries  _converted
173   0x1703                1050.0      1050.0
193   0x1723                1044.0      1044.0
198   0x1728                1936.0      1936.0
234   0x1760                 568.0       568.0
312   0x17d6                1618.0      1618.0
348   0x180a                 525.0       525.0
503   0x18f1                1251.0      1251.0
946   0x1b8c                  76.0        76.0
1017  0x1bf7                 285.0       285.0
1100  0x1c72                 119.0       119.0

--- Credit_Utilization_Ratio ---
outliers (IQR): 4 (0.00%)
Media: 32.28, Desvio Padrao: 5.11

            ID  Credit_Utilization_Ratio  _converted
9382    0x4cf8                 50.000000   50.000000
17029   0x79c7                 49.522324   49.522324
62954  0x186e0                 49.254983   49.254983
68000  0x1a472                 49.564519   49.564519

--- Changed_Credit_Limit ---
NaN/None: 3150 (2.10%)

         ID Changed_Credit_Limit
2    0x1604                    _
65   0x1663                    _
66   0x1664                    _
109  0x16a3                    _
110  0x16a4                    _
177  0x170b                    _
243  0x176d                    _
248  0x1776                    _
254  0x177c                    _
299  0x17c1                    _

non-convertible: 3150 (2.10%)
examples non-convertible values: ['_']

         ID Changed_Credit_Limit
2    0x1604                    _
65   0x1663                    _
66   0x1664                    _
109  0x16a3                    _
110  0x16a4                    _
177  0x170b                    _
243  0x176d                    _
248  0x1776                    _
254  0x177c                    _
299  0x17c1                    _

zeros: 6 (0.00%)

             ID Changed_Credit_Limit
26707    0xb27d                  0.0
41779   0x10acd                  0.0
56685   0x16223                  0.0
94085   0x23d47                  0.0
125420  0x13fee                  0.0

negatives: 2421 (1.61%)

         ID Changed_Credit_Limit
27   0x1629                -2.01
28   0x162a                -1.01
29   0x162b                -3.01
73   0x166f  -1.2400000000000002
179  0x170d                -4.14

outliers (IQR): 1052 (0.70%)
Media: 10.38, Desvio Padrao: 6.79

         ID Changed_Credit_Limit  _converted
584  0x196e                29.52       29.52
585  0x196f                29.52       29.52
586  0x1970                31.52       31.52
587  0x1971                29.52       29.52
588  0x1972                29.52       29.52
589  0x1973                29.52       29.52
590  0x1974                29.52       29.52
591  0x1975                29.52       29.52
633  0x19b7                29.21       29.21
682  0x1a00                32.64       32.64

--- Outstanding_Debt ---
NaN/None: 1500 (1.00%)

         ID Outstanding_Debt
87   0x1681         1328.93_
142  0x16d4         1283.37_
368  0x182a         2797.17_
632  0x19b6         3818.57_
703  0x1a1d          343.84_
731  0x1a49          363.51_
782  0x1a94          404.51_
819  0x1acd         1755.81_
835  0x1ae5         2593.44_
992  0x1bd2           89.62_

non-convertible: 1500 (1.00%)
examples non-convertible values: ['1328.93_', '1283.37_', '2797.17_', '3818.57_', '343.84_', '363.51_', '404.51_', '1755.81_', '2593.44_', '89.62_', '1054.86_', '1374.23_', '1166.47_', '457.81_', '1684.06_', '1126.35_', '2098.83_', '761.18_', '1343.01_', '1342.61_']

         ID Outstanding_Debt
87   0x1681         1328.93_
142  0x16d4         1283.37_
368  0x182a         2797.17_
632  0x19b6         3818.57_
703  0x1a1d          343.84_
731  0x1a49          363.51_
782  0x1a94          404.51_
819  0x1acd         1755.81_
835  0x1ae5         2593.44_
992  0x1bd2           89.62_

outliers (IQR): 7831 (5.22%)
Media: 1426.17, Desvio Padrao: 1155.13

         ID Outstanding_Debt  _converted
416  0x1872          4071.62     4071.62
417  0x1873          4071.62     4071.62
418  0x1874          4071.62     4071.62
419  0x1875          4071.62     4071.62
420  0x1876          4071.62     4071.62
421  0x1877          4071.62     4071.62
422  0x1878          4071.62     4071.62
423  0x1879          4071.62     4071.62
480  0x18d2          4834.59     4834.59
481  0x18d3          4834.59     4834.59

--- Interest_Rate ---
outliers (IQR): 3000 (2.00%)
Media: 71.23, Desvio Padrao: 461.54

         ID  Interest_Rate  _converted
44   0x1642           5318        5318
89   0x1687            433         433
167  0x16f9           5240        5240
178  0x170c           4975        4975
229  0x1757            668         668
325  0x17e7            753         753
344  0x1806            748         748
345  0x1807           1138        1138
472  0x18c6           5261        5261
482  0x18d4           3238        3238

# Passo 5: Função auxiliar para limpeza das colunas

Neste passo, utilizamos uma função auxiliar para limpar as colunas do dataset. A partir da análise dos dados, identificamos valores inconsistentes que devem ser removidos ou corrigidos. Além disso, aproveitamos os registros de uma mesma pessoa (Customer_ID) para preencher valores faltantes ou corrigir erros, aumentando a consistência e a qualidade do dataset.

In [ ]:
def clean_column_group(s, column_type, to_clean=None, clean_negatives=False):
    if to_clean is not None:
        if isinstance(to_clean, (list, tuple, set)):
            s = s.replace(list(to_clean), np.nan)
        else:
            s = s.replace(to_clean, np.nan)
    if column_type == "string":
        mode = s.loc[s.notna() & (s != "") & (s.astype(str).str.lower() != "nan")].mode()
        fill_value = mode[0] if not mode.empty else ""
        return s.replace({None: fill_value, "": fill_value, "nan": fill_value, np.nan: fill_value})
    if column_type == "numerical":
        if clean_negatives:
            s = s.where(s >= 0, np.nan)
        s_num = pd.to_numeric(s, errors="coerce")
        vals = s_num.dropna()
        if len(vals) >= 5:
            q1 = vals.quantile(0.25)
            q3 = vals.quantile(0.75)
            iqr = q3 - q1
            lo = q1 - 1.5 * iqr
            hi = q3 + 1.5 * iqr
            out_mask = (s_num < lo) | (s_num > hi)
            for idx in s_num[out_mask].index:
                # Se só esse valor é outlier no grupo, trate como erro
                if (s_num[out_mask].count() == 1):
                    s_num.at[idx] = np.nan  # ou mediana do grupo
                else:
                    # Outlier recorrente, pode ser comportamento real
                    pass
        mean_value = s_num.mean()
        return s_num.fillna(mean_value)
    return s

> Não há informações oficiais no fórum sobre os valores `__10000__`, então optamos por removê-los do dataset.
> Para os valores que possuem o caractere `_`, entendemos que se trata de erro de digitação e a solução é simplesmente remover o `_`.

In [ ]:
#Limpeza dos valores inválidos na coluna 'Amount_invested_monthly'
mask = df['Amount_invested_monthly'].astype(str).str.strip() == '__10000__'
df = df[~mask].reset_index(drop=True)

In [ ]:
#Limpeza e conversão das colunas numéricas de valores que contem o char '_'
for col in cols_should_be_num:
    if col in df.columns:
        s = df[col].astype(str).str.replace('_', '', regex=False).str.strip()
        s = s.replace({'': np.nan, 'nan': np.nan})
        df[col] = pd.to_numeric(s, errors='coerce')

In [ ]:
cols_should_be_num

['Amount_invested_monthly',
 'Annual_Income',
 'Num_of_Loan',
 'Age',
 'Num_Bank_Accounts',
 'Delay_from_due_date',
 'Total_EMI_per_month',
 'Monthly_Balance',
 'Num_of_Delayed_Payment',
 'Monthly_Inhand_Salary',
 'Num_Credit_Card',
 'Num_Credit_Inquiries',
 'Credit_Utilization_Ratio',
 'Changed_Credit_Limit',
 'Outstanding_Debt',
 'Interest_Rate']

In [ ]:
for col in cols_should_be_num:
    df[col] = pd.to_numeric(df[col], errors='coerce')

# Passo 6: Limpeza das colunas numéricas

Nesta etapa, aplicamos a função de limpeza nas colunas numéricas do dataset, corrigindo valores inconsistentes, removendo outliers (mas outliers baseados na mesma pessoa) e preenchendo valores faltantes. Esse processo garante que as variáveis estejam adequadas para as próximas etapas de análise e modelagem.

In [ ]:
df['Num_Credit_Card'] = df.groupby('Customer_ID')['Num_Credit_Card'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Interest_Rate'] = df.groupby('Customer_ID')['Interest_Rate'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Credit_Utilization_Ratio'] = df.groupby('Customer_ID')['Credit_Utilization_Ratio'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Num_of_Delayed_Payment'] = df.groupby('Customer_ID')['Num_of_Delayed_Payment'].transform(
    lambda s: clean_column_group(s, "numerical", clean_negatives=True)
)
df['Changed_Credit_Limit'] = df.groupby('Customer_ID')['Changed_Credit_Limit'].transform(
    lambda s: clean_column_group(s, "numerical", clean_negatives=True)
)
df['Total_EMI_per_month'] = df.groupby('Customer_ID')['Total_EMI_per_month'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Num_of_Loan'] = df.groupby('Customer_ID')['Num_of_Loan'].transform(
    lambda s: clean_column_group(s, "numerical", clean_negatives=True)
)
df['Monthly_Balance'] = df.groupby('Customer_ID')['Monthly_Balance'].transform(
    lambda s: clean_column_group(s, "numerical", to_clean=['__-333333333333333333333333333__'], clean_negatives=True)
)
df['Outstanding_Debt'] = df.groupby('Customer_ID')['Outstanding_Debt'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Num_Bank_Accounts'] = df.groupby('Customer_ID')['Num_Bank_Accounts'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Delay_from_due_date'] = df.groupby('Customer_ID')['Delay_from_due_date'].transform(
    lambda s: clean_column_group(s, "numerical", clean_negatives=True)
)
df['Amount_invested_monthly'] = df.groupby('Customer_ID')['Amount_invested_monthly'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Num_Credit_Inquiries'] = df.groupby('Customer_ID')['Num_Credit_Inquiries'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Monthly_Inhand_Salary'] = df.groupby('Customer_ID')['Monthly_Inhand_Salary'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Annual_Income'] = df.groupby('Customer_ID')['Annual_Income'].transform(
    lambda s: clean_column_group(s, "numerical")
)
df['Age'] = df.groupby('Customer_ID')['Age'].transform(
    lambda s: clean_column_group(s, "numerical", clean_negatives=True)
)

In [ ]:
analyze_numerical_column(cols_should_be_num, print_zeros=False)

--- Amount_invested_monthly ---
outliers (IQR): 11352 (7.91%)
Media: 189.23, Desvio Padrao: 186.91

        ID  Amount_invested_monthly  _converted
18  0x161d               825.216270  825.216270
40  0x1641               618.202391  618.202391
46  0x164b               698.873271  698.873271
51  0x1650               930.391898  930.391898
52  0x1651               870.522382  870.522382
63  0x1664               470.385796  470.385796
65  0x1666               649.809364  649.809364
66  0x1667               546.380571  546.380571
96  0x1695               494.842228  494.842228
98  0x1697               635.146561  635.146561

--- Annual_Income ---
outliers (IQR): 3012 (2.10%)
Media: 61257.99, Desvio Padrao: 413830.14

          ID  Annual_Income  _converted
1649  0x2022      173196.32   173196.32
1650  0x2023      173196.32   173196.32
1651  0x2024      173196.32   173196.32
1652  0x2025      173196.32   173196.32
1653  0x2026      173196.32   173196.32
1654  0x2027      173196.32   173196.32
1655  0x2028      173196.32   173196.32
1656  0x2029      173196.32   173196.32
2242  0x23ca      177150.40   177150.40
2243  0x23cb      177150.40   177150.40

--- Num_of_Loan ---
outliers (IQR): 53 (0.04%)
Media: 3.79, Desvio Padrao: 15.96

           ID  Num_of_Loan  _converted
20     0x161f        967.0       967.0
2181   0x236b       1017.0      1017.0
2186   0x2371        945.0       945.0
3145   0x2952         49.0        49.0
3150   0x2957        737.0       737.0
5363   0x36de         92.0        92.0
5367   0x36e2       1017.0      1017.0
12718  0x63de        545.0       545.0
12724  0x63e4        684.0       684.0
13173  0x66a5       1094.0      1094.0

--- Age ---
outliers (IQR): 1425 (0.99%)
Media: 74.87, Desvio Padrao: 487.45

         ID          Age   _converted
53   0x1656  7580.000000  7580.000000
235  0x176d  5079.000000  5079.000000
292  0x17c3  7080.000000  7080.000000
395  0x1861  3052.000000  3052.000000
431  0x189a  5342.000000  5342.000000
550  0x1958  2657.000000  2657.000000
579  0x1986  1032.000000  1032.000000
625  0x19ce   595.454545   595.454545
626  0x19cf   456.000000   456.000000
631  0x19d4  5717.000000  5717.000000

--- Num_Bank_Accounts ---
negatives: 37 (0.03%)

           ID  Num_Bank_Accounts
29058  0xc7b8               -1.0
29059  0xc7b9               -1.0
29060  0xc7ba               -1.0
29061  0xc7bb               -1.0
29062  0xc7bc               -1.0

outliers (IQR): 260 (0.18%)
Media: 6.94, Desvio Padrao: 43.15

          ID  Num_Bank_Accounts  _converted
279   0x17b2             1231.0      1231.0
1074  0x1c94             1696.0      1696.0
2221  0x23a9              741.0       741.0
2223  0x23ab              121.0       121.0
4752  0x332b             1312.0      1312.0
4757  0x3330             1315.0      1315.0
4785  0x335d              501.0       501.0
4788  0x3360             1566.0      1566.0
4984  0x3492              322.0       322.0
4987  0x3495              628.0       628.0

--- Delay_from_due_date ---
outliers (IQR): 5731 (3.99%)
Media: 21.07, Desvio Padrao: 14.82

         ID  Delay_from_due_date  _converted
224  0x175e                 61.0        61.0
225  0x175f                 61.0        61.0
226  0x1760                 61.0        61.0
227  0x1761                 61.0        61.0
228  0x1762                 61.0        61.0
229  0x1763                 61.0        61.0
230  0x1764                 61.0        61.0
231  0x1765                 61.0        61.0
285  0x17b8                 58.0        58.0
358  0x182a                 59.0        59.0

--- Total_EMI_per_month ---
outliers (IQR): 8476 (5.91%)
Media: 540.75, Desvio Padrao: 4828.98

         ID  Total_EMI_per_month    _converted
37   0x163e         15015.000000  15015.000000
42   0x1643         15515.000000  15515.000000
47   0x164c           911.220179    911.220179
48   0x164d         23834.000000  23834.000000
49   0x164e         32662.000000  32662.000000
50   0x164f           911.220179    911.220179
51   0x1650           911.220179    911.220179
52   0x1651           911.220179    911.220179
142  0x16dd           629.815653    629.815653
143  0x16de           629.815653    629.815653

--- Monthly_Balance ---
outliers (IQR): 10796 (7.52%)
Media: 408.24, Desvio Padrao: 213.12

        ID  Monthly_Balance   _converted
16  0x161a      1043.315978  1043.315978
17  0x161b       998.869297   998.869297
19  0x161e       810.782153   810.782153
20  0x161f       963.921581   963.921581
21  0x1620       968.555517   968.555517
44  0x1645       796.234910   796.234910
45  0x164a       858.462474   858.462474
47  0x164c      1038.569407  1038.569407
48  0x164d       899.198772   899.198772
49  0x164e       963.254819   963.254819

--- Num_of_Delayed_Payment ---
outliers (IQR): 1291 (0.90%)
Media: 25.80, Desvio Padrao: 183.41

          ID  Num_of_Delayed_Payment   _converted
136   0x16d2              153.875000   153.875000
244   0x177a             3318.000000  3318.000000
620   0x19c5              183.000000   183.000000
681   0x1a24             1106.000000  1106.000000
777   0x1ab9              834.000000   834.000000
988   0x1c0e             2672.000000  2672.000000
1161  0x1d1a             2008.000000  2008.000000
1183  0x1d3c               88.888889    88.888889
1186  0x1d3f               88.888889    88.888889
1245  0x1d9e               67.600000    67.600000

--- Monthly_Inhand_Salary ---
outliers (IQR): 2948 (2.05%)
Media: 4191.83, Desvio Padrao: 3182.56

          ID  Monthly_Inhand_Salary    _converted
335   0x1806           12432.610000  12432.610000
336   0x1807           12432.610000  12432.610000
337   0x1809           12432.610000  12432.610000
338   0x180a           12432.610000  12432.610000
339   0x180b           12432.610000  12432.610000
340   0x180c           12432.610000  12432.610000
341   0x180d           12432.610000  12432.610000
1649  0x2022           14258.026667  14258.026667
1650  0x2023           14258.026667  14258.026667
1651  0x2024           14258.026667  14258.026667

--- Num_Credit_Card ---
outliers (IQR): 772 (0.54%)
Media: 9.48, Desvio Padrao: 62.50

          ID  Num_Credit_Card  _converted
331   0x17fe           1327.0      1327.0
334   0x1801           1189.0      1189.0
419   0x188a            514.0       514.0
571   0x197a            262.0       262.0
677   0x1a1c            932.0       932.0
748   0x1a8f            848.0       848.0
1327  0x1e22           1297.0      1297.0
1328  0x1e23           1299.0      1299.0
1726  0x209a            102.0       102.0
2021  0x226e            184.0       184.0

--- Num_Credit_Inquiries ---
outliers (IQR): 1268 (0.88%)
Media: 16.52, Desvio Padrao: 131.41

          ID  Num_Credit_Inquiries   _converted
187   0x1723           1044.000000  1044.000000
192   0x1728           1936.000000  1936.000000
193   0x1729            284.363636   284.363636
226   0x1760            568.000000   568.000000
397   0x1867             45.818182    45.818182
907   0x1b8c             76.000000    76.000000
1308  0x1e07           1265.000000  1265.000000
1329  0x1e24           1265.000000  1265.000000
1675  0x2049           1952.000000  1952.000000
2329  0x2452            418.000000   418.000000

--- Credit_Utilization_Ratio ---
outliers (IQR): 5 (0.00%)
Media: 32.28, Desvio Padrao: 5.08

            ID  Credit_Utilization_Ratio  _converted
8979    0x4cf8                 50.000000   50.000000
16303   0x79c7                 49.522324   49.522324
60280  0x186e0                 49.254983   49.254983
65104  0x1a472                 49.564519   49.564519
83838  0x21741                 49.064277   49.064277

--- Changed_Credit_Limit ---
outliers (IQR): 1077 (0.75%)
Media: 10.45, Desvio Padrao: 6.63

          ID  Changed_Credit_Limit  _converted
563   0x196e                 29.52       29.52
564   0x196f                 29.52       29.52
565   0x1970                 31.52       31.52
566   0x1971                 29.52       29.52
567   0x1972                 29.52       29.52
568   0x1973                 29.52       29.52
569   0x1974                 29.52       29.52
570   0x1975                 29.52       29.52
658   0x1a00                 32.64       32.64
1245  0x1d9e                 33.43       33.43

--- Outstanding_Debt ---
outliers (IQR): 7549 (5.26%)
Media: 1425.82, Desvio Padrao: 1154.59

         ID  Outstanding_Debt  _converted
404  0x1872           4071.62     4071.62
405  0x1873           4071.62     4071.62
406  0x1874           4071.62     4071.62
407  0x1875           4071.62     4071.62
408  0x1876           4071.62     4071.62
409  0x1877           4071.62     4071.62
410  0x1878           4071.62     4071.62
411  0x1879           4071.62     4071.62
467  0x18d2           4834.59     4834.59
468  0x18d3           4834.59     4834.59

--- Interest_Rate ---
outliers (IQR): 555 (0.39%)
Media: 26.04, Desvio Padrao: 212.63

          ID  Interest_Rate  _converted
86    0x1687          433.0       433.0
335   0x1806          748.0       748.0
336   0x1807         1138.0      1138.0
815   0x1afa         5189.0      5189.0
820   0x1aff          872.0       872.0
1409  0x1e9d         2660.0      2660.0
2086  0x22d3         2882.0      2882.0
2130  0x231a         4614.0      4614.0
2157  0x2347         5627.0      5627.0
2262  0x23e6         2091.0      2091.0

In [ ]:
df.shape

(143520, 26)

# Passo 7: Verificação das colunas após tratamento

Neste passo, analisamos como ficaram as colunas do dataset após o processo de limpeza, conferindo os tipos de dados, valores únicos e possíveis inconsistências remanescentes. Essa verificação garante que as etapas anteriores foram eficazes e que os dados estão prontos para a análise final ou modelagem.

In [ ]:
num_cols = df.select_dtypes(include=['int64', 'float64']).columns
print(num_cols)
print(len(num_cols))

Index(['Age', 'Annual_Income', 'Monthly_Inhand_Salary', 'Num_Bank_Accounts',
       'Num_Credit_Card', 'Interest_Rate', 'Num_of_Loan',
       'Delay_from_due_date', 'Num_of_Delayed_Payment', 'Changed_Credit_Limit',
       'Num_Credit_Inquiries', 'Outstanding_Debt', 'Credit_Utilization_Ratio',
       'Total_EMI_per_month', 'Amount_invested_monthly', 'Monthly_Balance'],
      dtype='object')
16

In [ ]:
non_numeric_cols = df.select_dtypes(exclude=['number']).columns.tolist()
print(non_numeric_cols)

['ID', 'Customer_ID', 'Month', 'Occupation', 'Type_of_Loan', 'Credit_Mix', 'Credit_History_Age', 'Payment_of_Min_Amount', 'Payment_Behaviour', 'Credit_Score']

# Passo 8: Análise e tratamento das colunas não numéricas

Nesta etapa, começamos a analisar e tratar as colunas categóricas e textuais do dataset. Avaliamos valores únicos, identificamos inconsistências e aplicamos funções de limpeza para padronizar e corrigir possíveis erros, garantindo que essas variáveis estejam adequadas para a análise e modelagem.

In [ ]:
def count_non_numeric_uniques(cols):
    """
    Para cada coluna em `cols` imprime os valores textuais que não viraram número
    """
    for col in cols:
        print('---', col, '---')
        print(f"Unique values count: {df[col].nunique()}\n")

In [ ]:
count_non_numeric_uniques(non_numeric_cols)

--- ID ---
Unique values count: 143520

--- Customer_ID ---
Unique values count: 12500

--- Month ---

Unique values count: 12

--- Occupation ---
Unique values count: 16

--- Type_of_Loan ---
Unique values count: 6260

--- Credit_Mix ---
Unique values count: 4

--- Credit_History_Age ---
Unique values count: 408

--- Payment_of_Min_Amount ---
Unique values count: 3

--- Payment_Behaviour ---
Unique values count: 7

--- Credit_Score ---
Unique values count: 3

In [ ]:
print(f"Month: {df['Month'].unique()}\n")
print(f"Occupation: {df['Occupation'].unique()}\n")
print(f"Credit_Mix: {df['Credit_Mix'].unique()}\n")
print(f"Payment_of_Min_Amount: {df['Payment_of_Min_Amount'].unique()}\n")
print(f"Payment_Behaviour: {df['Payment_Behaviour'].unique()}\n")
print(f"Credit_Score: {df['Credit_Score'].unique()}\n")

Month: ['January' 'February' 'March' 'April' 'May' 'June' 'July' 'August'
 'September' 'October' 'November' 'December']

Occupation: ['Scientist' '_______' 'Teacher' 'Engineer' 'Entrepreneur' 'Developer'
 'Lawyer' 'Media_Manager' 'Doctor' 'Journalist' 'Manager' 'Accountant'
 'Musician' 'Mechanic' 'Writer' 'Architect']

Credit_Mix: ['_' 'Good' 'Standard' 'Bad']

Payment_of_Min_Amount: ['No' 'NM' 'Yes']

Payment_Behaviour: ['High_spent_Small_value_payments' 'Low_spent_Large_value_payments'
 'Low_spent_Medium_value_payments' 'Low_spent_Small_value_payments'
 'High_spent_Medium_value_payments' '!@9#%8'
 'High_spent_Large_value_payments']

Credit_Score: ['Good' 'Standard' 'Poor' nan]

In [ ]:
df['Occupation'] = df.groupby('Customer_ID')['Occupation'].transform(
    lambda s: clean_column_group(s, "string", to_clean=["_______"])
)

df['Credit_Mix'] = df.groupby('Customer_ID')['Credit_Mix'].transform(
    lambda s: clean_column_group(s, "string", to_clean=["_"])
)

df['Payment_Behaviour'] = df.groupby('Customer_ID')['Payment_Behaviour'].transform(
    lambda s: clean_column_group(s, "string", to_clean=["!@9#%8"])
)

In [ ]:
print(f"Type of loan: {df['Type_of_Loan'].unique()}\n")

Type of loan: ['Auto Loan, Credit-Builder Loan, Personal Loan, and Home Equity Loan'
 'Credit-Builder Loan' 'Auto Loan, Auto Loan, and Not Specified' ...
 'Home Equity Loan, Auto Loan, Auto Loan, and Auto Loan'
 'Payday Loan, Student Loan, Mortgage Loan, and Not Specified'
 'Personal Loan, Auto Loan, Mortgage Loan, Student Loan, and Student Loan']

In [ ]:
print(f"Credit History Age: {df['Credit_History_Age'].unique()}\n")

Credit History Age: ['22 Years and 1 Months' nan '22 Years and 3 Months'
 '22 Years and 4 Months' '22 Years and 5 Months' '22 Years and 6 Months'
 '22 Years and 7 Months' '26 Years and 7 Months' '26 Years and 8 Months'
 '26 Years and 9 Months' '26 Years and 10 Months' '26 Years and 11 Months'
 '27 Years and 0 Months' '27 Years and 1 Months' '27 Years and 2 Months'
 '17 Years and 9 Months' '17 Years and 10 Months' '18 Years and 1 Months'
 '18 Years and 2 Months' '18 Years and 3 Months' '17 Years and 3 Months'
 '17 Years and 4 Months' '17 Years and 5 Months' '17 Years and 6 Months'
 '17 Years and 8 Months' '30 Years and 8 Months' '30 Years and 9 Months'
 '30 Years and 10 Months' '30 Years and 11 Months' '31 Years and 0 Months'
 '31 Years and 1 Months' '31 Years and 2 Months' '31 Years and 3 Months'
 '32 Years and 0 Months' '32 Years and 2 Months' '32 Years and 3 Months'
 '32 Years and 5 Months' '32 Years and 6 Months' '30 Years and 7 Months'
 '14 Years and 8 Months' '14 Years and 9 Months' '14 Years and 10 Months'
 '14 Years and 11 Months' '15 Years and 0 Months' '15 Years and 1 Months'
 '15 Years and 2 Months' '21 Years and 4 Months' '21 Years and 5 Months'
 '21 Years and 6 Months' '21 Years and 7 Months' '21 Years and 8 Months'
 '21 Years and 9 Months' '21 Years and 10 Months' '21 Years and 11 Months'
 '26 Years and 6 Months' '19 Years and 2 Months' '19 Years and 3 Months'
 '19 Years and 4 Months' '19 Years and 5 Months' '19 Years and 6 Months'
 '19 Years and 7 Months' '19 Years and 8 Months' '25 Years and 5 Months'
 '25 Years and 6 Months' '25 Years and 7 Months' '25 Years and 8 Months'
 '25 Years and 9 Months' '25 Years and 10 Months' '25 Years and 11 Months'
 '26 Years and 0 Months' '27 Years and 3 Months' '27 Years and 4 Months'
 '27 Years and 5 Months' '8 Years and 11 Months' '9 Years and 0 Months'
 '9 Years and 1 Months' '9 Years and 2 Months' '9 Years and 3 Months'
 '9 Years and 4 Months' '9 Years and 6 Months' '18 Years and 4 Months'
 '18 Years and 5 Months' '18 Years and 6 Months' '18 Years and 8 Months'
 '18 Years and 9 Months' '16 Years and 10 Months' '17 Years and 0 Months'
 '17 Years and 1 Months' '17 Years and 2 Months' '29 Years and 2 Months'
 '29 Years and 3 Months' '29 Years and 4 Months' '29 Years and 6 Months'
 '29 Years and 8 Months' '29 Years and 9 Months' '6 Years and 5 Months'
 '6 Years and 6 Months' '6 Years and 7 Months' '6 Years and 8 Months'
 '6 Years and 9 Months' '6 Years and 10 Months' '7 Years and 0 Months'
 '27 Years and 6 Months' '27 Years and 7 Months' '27 Years and 8 Months'
 '27 Years and 9 Months' '18 Years and 7 Months' '19 Years and 9 Months'
 '19 Years and 10 Months' '10 Years and 1 Months' '10 Years and 2 Months'
 '10 Years and 3 Months' '10 Years and 4 Months' '10 Years and 5 Months'
 '10 Years and 6 Months' '10 Years and 7 Months' '10 Years and 8 Months'
 '32 Years and 9 Months' '32 Years and 10 Months' '32 Years and 11 Months'
 '33 Years and 0 Months' '33 Years and 1 Months' '33 Years and 4 Months'
 '12 Years and 3 Months' '12 Years and 4 Months' '12 Years and 5 Months'
 '12 Years and 6 Months' '12 Years and 7 Months' '12 Years and 8 Months'
 '12 Years and 10 Months' '12 Years and 9 Months' '17 Years and 11 Months'
 '13 Years and 8 Months' '13 Years and 11 Months' '14 Years and 0 Months'
 '14 Years and 1 Months' '14 Years and 2 Months' '14 Years and 3 Months'
 '30 Years and 3 Months' '30 Years and 4 Months' '30 Years and 5 Months'
 '30 Years and 6 Months' '8 Years and 9 Months' '8 Years and 10 Months'
 '18 Years and 10 Months' '18 Years and 11 Months' '19 Years and 0 Months'
 '19 Years and 1 Months' '8 Years and 8 Months' '13 Years and 1 Months'
 '13 Years and 2 Months' '13 Years and 3 Months' '13 Years and 5 Months'
 '13 Years and 6 Months' '13 Years and 7 Months' '22 Years and 0 Months'
 '26 Years and 1 Months' '26 Years and 2 Months' '13 Years and 4 Months'
 '13 Years and 9 Months' '27 Years and 11 Months' '28 Years and 0 Months'
 '28 Years and 1 Months' '28 Years and 2 Months' '28 Years and 3 Months'
 '28 Years and 4 Months' '28 Years and 5 Months' '28 Years and 6 Months'
 '7 Years and 10 Months' '7 Years and 11 Months' '8 Years and 0 Months'
 '8 Years and 1 Months' '8 Years and 2 Months' '8 Years and 3 Months'
 '8 Years and 4 Months' '8 Years and 5 Months' '24 Years and 3 Months'
 '24 Years and 4 Months' '24 Years and 5 Months' '24 Years and 6 Months'
 '24 Years and 7 Months' '24 Years and 8 Months' '24 Years and 9 Months'
 '17 Years and 7 Months' '1 Years and 2 Months' '1 Years and 3 Months'
 '1 Years and 4 Months' '1 Years and 5 Months' '1 Years and 6 Months'
 '1 Years and 7 Months' '1 Years and 8 Months' '10 Years and 11 Months'
 '11 Years and 0 Months' '11 Years and 1 Months' '11 Years and 2 Months'
 '11 Years and 3 Months' '11 Years and 4 Months' '11 Years and 5 Months'
 '11 Years and 6 Months' '19 Years and 11 Months' '20 Years and 0 Months'
 '20 Years and 1 Months' '10 Years and 9 Months' '10 Years and 10 Months'
 '14 Years and 4 Months' '14 Years and 5 Months' '14 Years and 6 Months'
 '20 Years and 9 Months' '20 Years and 10 Months' '20 Years and 11 Months'
 '21 Years and 0 Months' '21 Years and 1 Months' '21 Years and 2 Months'
 '21 Years and 3 Months' '0 Years and 4 Months' '0 Years and 5 Months'
 '0 Years and 6 Months' '0 Years and 8 Months' '0 Years and 9 Months'
 '0 Years and 10 Months' '31 Years and 7 Months' '31 Years and 8 Months'
 '31 Years and 9 Months' '31 Years and 10 Months' '31 Years and 11 Months'
 '32 Years and 1 Months' '16 Years and 11 Months' '12 Years and 11 Months'
 '13 Years and 0 Months' '27 Years and 10 Months' '11 Years and 7 Months'
 '11 Years and 8 Months' '11 Years and 9 Months' '11 Years and 10 Months'
 '24 Years and 10 Months' '24 Years and 11 Months' '25 Years and 0 Months'
 '25 Years and 1 Months' '25 Years and 2 Months' '25 Years and 3 Months'
 '18 Years and 0 Months' '31 Years and 4 Months' '31 Years and 5 Months'
 '31 Years and 6 Months' '5 Years and 2 Months' '5 Years and 3 Months'
 '5 Years and 4 Months' '5 Years and 5 Months' '5 Years and 6 Months'
 '5 Years and 7 Months' '5 Years and 8 Months' '5 Years and 9 Months'
 '2 Years and 11 Months' '3 Years and 0 Months' '3 Years and 1 Months'
 '3 Years and 2 Months' '3 Years and 3 Months' '3 Years and 4 Months'
 '3 Years and 5 Months' '3 Years and 6 Months' '16 Years and 4 Months'
 '16 Years and 5 Months' '16 Years and 7 Months' '16 Years and 8 Months'
 '16 Years and 9 Months' '22 Years and 11 Months' '23 Years and 0 Months'
 '23 Years and 2 Months' '23 Years and 4 Months' '23 Years and 5 Months'
 '23 Years and 6 Months' '8 Years and 6 Months' '8 Years and 7 Months'
 '4 Years and 5 Months' '4 Years and 6 Months' '4 Years and 7 Months'
 '4 Years and 8 Months' '4 Years and 9 Months' '4 Years and 10 Months'
 '4 Years and 11 Months' '5 Years and 0 Months' '32 Years and 8 Months'
 '33 Years and 2 Months' '33 Years and 3 Months' '12 Years and 2 Months'
 '32 Years and 4 Months' '29 Years and 11 Months' '30 Years and 0 Months'
 '30 Years and 2 Months' '26 Years and 3 Months' '26 Years and 4 Months'
 '26 Years and 5 Months' '7 Years and 6 Months' '7 Years and 7 Months'
 '7 Years and 8 Months' '7 Years and 9 Months' '28 Years and 7 Months'
 '28 Years and 8 Months' '28 Years and 9 Months' '28 Years and 10 Months'
 '29 Years and 5 Months' '29 Years and 7 Months' '20 Years and 2 Months'
 '20 Years and 3 Months' '20 Years and 4 Months' '20 Years and 5 Months'
 '20 Years and 6 Months' '20 Years and 7 Months' '20 Years and 8 Months'
 '28 Years and 11 Months' '29 Years and 0 Months' '13 Years and 10 Months'
 '1 Years and 9 Months' '1 Years and 10 Months' '1 Years and 11 Months'
 '33 Years and 5 Months' '33 Years and 6 Months' '33 Years and 7 Months'
 '33 Years and 8 Months' '29 Years and 1 Months' '5 Years and 1 Months'
 '5 Years and 10 Months' '5 Years and 11 Months' '6 Years and 0 Months'
 '6 Years and 1 Months' '6 Years and 2 Months' '6 Years and 3 Months'
 '22 Years and 9 Months' '22 Years and 10 Months' '16 Years and 6 Months'
 '23 Years and 1 Months' '23 Years and 3 Months' '22 Years and 2 Months'
 '15 Years and 4 Months' '15 Years and 5 Months' '15 Years and 6 Months'
 '15 Years and 7 Months' '15 Years and 8 Months' '15 Years and 9 Months'
 '15 Years and 11 Months' '2 Years and 3 Months' '2 Years and 4 Months'
 '2 Years and 5 Months' '2 Years and 6 Months' '2 Years and 7 Months'
 '2 Years and 8 Months' '2 Years and 9 Months' '2 Years and 10 Months'
 '2 Years and 0 Months' '15 Years and 10 Months' '16 Years and 2 Months'
 '16 Years and 3 Months' '22 Years and 8 Months' '9 Years and 5 Months'
 '9 Years and 8 Months' '9 Years and 9 Months' '11 Years and 11 Months'
 '12 Years and 0 Months' '12 Years and 1 Months' '24 Years and 2 Months'
 '16 Years and 0 Months' '16 Years and 1 Months' '14 Years and 7 Months'
 '25 Years and 4 Months' '15 Years and 3 Months' '6 Years and 11 Months'
 '7 Years and 1 Months' '7 Years and 2 Months' '7 Years and 3 Months'
 '7 Years and 4 Months' '7 Years and 5 Months' '23 Years and 7 Months'
 '23 Years and 8 Months' '23 Years and 9 Months' '30 Years and 1 Months'
 '29 Years and 10 Months' '9 Years and 10 Months' '9 Years and 11 Months'
 '10 Years and 0 Months' '2 Years and 2 Months' '23 Years and 10 Months'
 '23 Years and 11 Months' '24 Years and 0 Months' '9 Years and 7 Months'
 '24 Years and 1 Months' '6 Years and 4 Months' '0 Years and 1 Months'
 '0 Years and 2 Months' '0 Years and 3 Months' '0 Years and 7 Months'
 '3 Years and 8 Months' '32 Years and 7 Months' '3 Years and 7 Months'
 '3 Years and 9 Months' '3 Years and 10 Months' '0 Years and 11 Months'
 '1 Years and 0 Months' '1 Years and 1 Months' '4 Years and 4 Months'
 '3 Years and 11 Months' '4 Years and 0 Months' '4 Years and 1 Months'
 '4 Years and 2 Months' '4 Years and 3 Months' '2 Years and 1 Months'
 '33 Years and 9 Months' '33 Years and 10 Months' '33 Years and 11 Months'
 '34 Years and 0 Months']

In [ ]:
print(f"Occupation: {df['Occupation'].unique()}\n")
print(f"Credit_Mix: {df['Credit_Mix'].unique()}\n")

Occupation: ['Scientist' 'Teacher' 'Engineer' 'Entrepreneur' 'Developer' 'Lawyer'
 'Media_Manager' 'Doctor' 'Journalist' 'Manager' 'Accountant' 'Musician'
 'Mechanic' 'Writer' 'Architect']

Credit_Mix: ['Good' 'Standard' 'Bad']

# Passo 9: Salvando o dataset limpo

Após o tratamento e limpeza dos dados, salvamos o dataset final em um novo arquivo CSV (`cleaned_data.csv`). Isso permite a realização de análises gráficas e o início da etapa de classificação.

In [ ]:
clean_df = df.copy().to_csv('cleaned_data.csv', index=False)